In [1]:
import pandas as pd

In [12]:
stocks = pd.read_csv('data/small-stocks.csv')

stocks.head()

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT
3  2016-10-04  113.00  29736800   AAPL
4  2016-10-04   57.24  20085900   MSFT

In [15]:
ser = stocks.groupby(['Symbol', 'Date'])['Close'].mean()

ser

Symbol  Date
AAPL    2016-10-03    112.52
        2016-10-04    113.00
        2016-10-05    113.05
CSCO    2016-10-03     31.50
        2016-10-04     31.35
        2016-10-05     31.59
MSFT    2016-10-03     57.42
        2016-10-04     57.24
        2016-10-05     57.64
Name: Close, dtype: float64

Series has a multi-index...

In [16]:
ser.index

MultiIndex([('AAPL', '2016-10-03'),
            ('AAPL', '2016-10-04'),
            ('AAPL', '2016-10-05'),
            ('CSCO', '2016-10-03'),
            ('CSCO', '2016-10-04'),
            ('CSCO', '2016-10-05'),
            ('MSFT', '2016-10-03'),
            ('MSFT', '2016-10-04'),
            ('MSFT', '2016-10-05')],
           names=['Symbol', 'Date'])

In [29]:
# unstack the innermost level and return a dataframe
df = ser.unstack()
df

Date    2016-10-03  2016-10-04  2016-10-05
Symbol
AAPL        112.52      113.00      113.05
CSCO         31.50       31.35       31.59
MSFT         57.42       57.24       57.64

In [22]:
# unstack a specific level
ser.unstack(level=0)

Symbol        AAPL   CSCO   MSFT
Date
2016-10-03  112.52  31.50  57.42
2016-10-04  113.00  31.35  57.24
2016-10-05  113.05  31.59  57.64

In [23]:
# get the same thing with a pivot table (aggfunc defaults to mean)
stocks.pivot_table(index='Date', columns='Symbol', values='Close')

Symbol        AAPL   CSCO   MSFT
Date
2016-10-03  112.52  31.50  57.42
2016-10-04  113.00  31.35  57.24
2016-10-05  113.05  31.59  57.64

## Selection

In [24]:
ser

Symbol  Date
AAPL    2016-10-03    112.52
        2016-10-04    113.00
        2016-10-05    113.05
CSCO    2016-10-03     31.50
        2016-10-04     31.35
        2016-10-05     31.59
MSFT    2016-10-03     57.42
        2016-10-04     57.24
        2016-10-05     57.64
Name: Close, dtype: float64

In [26]:
# Select just using the outer-most index
ser.loc['AAPL']

Date
2016-10-03    112.52
2016-10-04    113.00
2016-10-05    113.05
Name: Close, dtype: float64

In [27]:
# Select using multiple levels
ser.loc['AAPL', '2016-10-04']

113.0

In [28]:
# Select using the innermost index
ser.loc[:, '2016-10-04']

Symbol
AAPL    113.00
CSCO     31.35
MSFT     57.24
Name: Close, dtype: float64

In [30]:
# Selection works exactly the same for a dataframe!
df.loc[:, '2016-10-04']

Symbol
AAPL    113.00
CSCO     31.35
MSFT     57.24
Name: 2016-10-04, dtype: float64